define('mods/mobile/regionSetting', function(require, exports, module) {
    //获得级联数据
    function Region() {}
    Region.prototype.getData = function(v) {
        var myArray = new Array();

        myArray["北京"] = ['不限', '东城区', '西城区', '崇文区', '宣武区', '朝阳区', '丰台区', '石景山区', '海淀区', '门头沟区', '房山区', '通州区', '顺义区', '昌平区', '大兴区', '怀柔区', '平谷区', '密云县', '延庆县'];

        myArray["重庆"] = ['不限', '万州区', '涪陵区', '渝中区', '大渡口区', '江北区', '沙坪坝区', '九龙坡区', '南岸区', '北碚区', '万盛区', '双桥区', '渝北区', '巴南区', '黔江区', '长寿区', '綦江县', '潼南县', '铜梁县', '大足县', '荣昌县', '璧山县', '梁平县', '城口县', '丰都县', '垫江县', '武隆县', '忠县', '开县', '云阳县', '奉节县', '巫山县', '巫溪县', '石柱土家族自治县', '秀山土家族苗族自治县', '酉阳土家族苗族自治县', '彭水苗族土家族自治县', '江津区', '合川区', '永川区', '南川区'];

        myArray["福建"] = ['不限', '福州', '厦门', '莆田', '三明', '泉州', '漳州', '南平', '龙岩', '宁德'];

        myArray["甘肃"] = ['不限', '兰州', '嘉峪关', '金昌', '白银', '天水', '武威', '张掖', '平凉', '酒泉', '庆阳', '定西', '陇南', '临夏', '甘南'];

        myArray["广东"] = ['不限', '广州', '韶关', '深圳', '珠海', '汕头', '佛山', '江门', '湛江', '茂名', '肇庆', '惠州', '梅州', '汕尾', '河源', '阳江', '清远', '东莞', '中山', '潮州', '揭阳', '云浮'];

        myArray["广西"] = ['不限', '南宁', '柳州', '桂林', '梧州', '北海', '防城港', '钦州', '贵港', '玉林', '百色', '贺州', '河池'];

        myArray["贵州"] = ['不限', '贵阳', '六盘水', '遵义', '安顺', '铜仁', '黔西南', '毕节', '黔东南', '黔南'];

        myArray["海南"] = ['不限', '海口', '三亚', '其他'];

        myArray["河北"] = ['不限', '石家庄', '唐山', '秦皇岛', '邯郸', '邢台', '保定', '张家口', '承德', '沧州', '廊坊', '衡水'];

        myArray["河南"] = ['不限', '郑州', '开封', '洛阳', '平顶山', '安阳', '鹤壁', '新乡', '焦作', '濮阳', '许昌', '漯河', '三门峡', '南阳', '商丘', '信阳', '周口', '驻马店', '济源'];

        myArray["黑龙江"] = ['不限', '哈尔滨', '齐齐哈尔', '鸡西', '鹤岗', '双鸭山', '大庆', '伊春', '佳木斯', '七台河', '牡丹江', '黑河', '绥化', '大兴安岭'];

        myArray["湖北"] = ['不限', '武汉', '黄石', '十堰', '宜昌', '襄阳', '鄂州', '荆门', '孝感', '荆州', '黄冈', '咸宁', '随州', '恩施', '土家族苗族自治州', '仙桃', '潜江', '天门', '神农架'];

        myArray["湖南"] = ['不限', '长沙', '株洲', '湘潭', '衡阳', '邵阳', '岳阳', '常德', '张家界', '益阳', '郴州', '永州', '怀化', '娄底', '湘西土家族苗族自治州'];

        myArray["内蒙古"] = ['不限', '呼和浩特', '包头', '乌海', '赤峰', '通辽', '鄂尔多斯', '呼伦贝尔', '兴安盟', '锡林郭勒盟', '乌兰察布盟', '巴彦淖尔盟', '阿拉善盟'];

        myArray["江苏"] = ['不限', '南京', '无锡', '徐州', '常州', '苏州', '南通', '连云港', '淮安', '盐城', '扬州', '镇江', '泰州', '宿迁'];

        myArray["江西"] = ['不限', '南昌', '景德镇', '萍乡', '九江', '新余', '鹰潭', '赣州', '吉安', '宜春', '抚州', '上饶'];

        myArray["吉林"] = ['不限', '长春', '吉林', '四平', '辽源', '通化', '白山', '松原', '白城', '延边朝鲜族自治州'];

        myArray["辽宁"] = ['不限', '沈阳', '大连', '鞍山', '抚顺', '本溪', '丹东', '锦州', '营口', '阜新', '辽阳', '盘锦', '铁岭', '朝阳', '葫芦岛'];

        myArray["宁夏"] = ['不限', '银川', '石嘴山', '吴忠', '固原', '中卫'];

        myArray["青海"] = ['不限', '西宁', '海东', '海北', '黄南', '海南', '果洛', '玉树', '海西'];

        myArray["山西"] = ['不限', '太原', '大同', '阳泉', '长治', '晋城', '朔州', '晋中', '运城', '忻州', '临汾', '吕梁'];

        myArray["山东"] = ['不限', '济南', '青岛', '淄博', '枣庄', '东营', '烟台', '潍坊', '济宁', '泰安', '威海', '日照', '莱芜', '临沂', '德州', '聊城', '滨州', '菏泽'];

        myArray["上海"] = ['不限', '黄浦区', '卢湾区', '徐汇区', '长宁区', '静安区', '普陀区', '闸北区', '虹口区', '杨浦区', '闵行区', '宝山区', '嘉定区', '浦东新区', '金山区', '松江区', '青浦区', '奉贤区', '崇明县'];

        myArray["四川"] = ['不限', '成都', '自贡', '攀枝花', '泸州', '德阳', '绵阳', '广元', '遂宁', '内江', '乐山', '南充', '眉山', '宜宾', '广安', '达州', '雅安', '巴中', '资阳', '阿坝', '甘孜', '凉山'];

        myArray["天津"] = ['不限', '和平区', '河东区', '河西区', '南开区', '河北区', '红桥区', '塘沽区', '汉沽区', '大港区', '东丽区', '西青区', '津南区', '北辰区', '武清区', '宝坻区', '宁河县', '静海县', '蓟县', '滨海新区', '保税区'];

        myArray["西藏"] = ['不限', '拉萨', '昌都', '山南', '日喀则', '那曲', '阿里', '林芝'];

        myArray["新疆"] = ['不限', '乌鲁木齐', '克拉玛依', '吐鲁番', '哈密', '昌吉', '博尔塔拉', '巴音郭楞', '阿克苏', '克孜勒苏', '喀什', '和田', '伊犁', '塔城', '阿勒泰', '石河子'];

        myArray["云南"] = ['不限', '昆明', '曲靖', '玉溪', '保山', '昭通', '楚雄', '红河', '文山', '思茅', '西双版纳', '大理', '德宏', '丽江', '怒江', '迪庆', '临沧'];

        myArray["浙江"] = ['不限', '杭州', '宁波', '温州', '嘉兴', '湖州', '绍兴', '金华', '衢州', '舟山', '台州', '丽水'];

        myArray["安徽"] = ['不限', '合肥', '芜湖', '蚌埠', '淮南', '马鞍山', '淮北', '铜陵', '安庆', '黄山', '滁州', '阜阳', '宿州', '巢湖', '六安', '毫州', '池州', '宣城'];

        myArray["陕西"] = ['不限', '西安', '铜川', '宝鸡', '咸阳', '渭南', '延安', '汉中', '榆林', '安康', '商洛'];

        myArray["台湾"] = ['不限', '台北', '高雄', '基隆', '台中', '台南', '新竹', '嘉义', '其他'];

        myArray["香港"] = ['不限', '香港'];

        myArray["澳门"] = ['不限', '澳门'];

        myArray["海外"] = ['不限', '美国', '英国', '法国', '俄罗斯', '加拿大', '巴西', '澳大利亚', '印尼', '泰国', '马来西亚', '新加坡', '菲律宾', '越南', '印度', '日本', '新西兰', '韩国', '德国', '意大利', '爱尔兰', '荷兰', '瑞士', '乌克兰', '南非', '芬兰', '瑞典', '奥地利', '西班牙', '比利时', '挪威', '丹麦', '波兰', '阿根廷', '白俄罗斯', '哥伦比亚', '古巴', '埃及', '希腊', '匈牙利', '伊朗', '蒙古', '墨西哥', '葡萄牙', '沙特阿拉伯', '土耳其', '捷克', '斯洛伐克', '其他'];

        var listr = '',
            key, keyValue;
        for (key in myArray) {
            listr += '<li data-val="' + key + '">' + key + '<ul>';
            for (keyValue in myArray[key]) {
                listr += '<li data-val="' + myArray[key][keyValue] + '">' + myArray[key][keyValue] + '</li>';
            }
            listr += '</ul></li>';
        }
        return listr;
    };
    module.exports = Region;
});
